# GetDownstreamSegments Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..GetDownstreamSegments Method
MEPNetworkSegmentData Class See Also
---
Gets all downstream network segments.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<MEPNetworkSegmentId> GetDownstreamSegments()
```

Visual Basic
---
```text
Public Function GetDownstreamSegments As IList(Of MEPNetworkSegmentId)
```

Visual C++
---
```text
public:
IList<MEPNetworkSegmentId^>^ GetDownstreamSegments()
```

# ### Return Value
The list of segments that flow out of this segment.
# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace